{"id":"c8b7d641-a624-480d-8182-72eb447fa49a","updated_at":"2025-07-23T18:31:08.804Z","updated_by":"elastic","created_at":"2025-07-23T18:31:08.804Z","created_by":"elastic","name":"Privilege Escalation","tags":["\"privilege escalation\""],"interval":"3m","enabled":true,"revision":0,"description":"Privilege Escalation detection","risk_score":70,"severity":"high","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-480s","rule_id":"6a002d93-de48-4bd9-a82f-c008dc41382a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["beat-*","auditbeat-*"],"query":"process.name: (\"sudo\" or \"su\" or \"pkexec\") AND user.name: \"root\"\n","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
